---
kind: property
id: P:Autodesk.Revit.DB.ElevationMarker.MaximumViewCount
source: html/d750401a-9b00-9af9-5cd6-27dfbdc41053.htm
---
# Autodesk.Revit.DB.ElevationMarker.MaximumViewCount Property

The maximum number of views that can be hosted by this ElevationMarker.

## Syntax (C#)
```csharp
public int MaximumViewCount { get; }
```